package carenbb.com.hackathon.emotion.joton;

/**
 * Created by HP on 28-Mar-16.
 */
public class DataMotherInfo {
    private String info;
    private String description;
    private int imageResourceId;

    public static final DataMotherInfo[] infos = {
            new DataMotherInfo("মায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজন",
                    "মায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়ো মায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজনদসজখ সদফাকজলহ সদফ লজকাসদফ্লসদজ সদফঝলজক্ল গসদজখ দস্ফাক্লঝ সাজক্লহ দস্ফাল্কজল ল্কসদফজাগ ল্ক জগক্ল সদফগ। ",
                    R.drawable.cheese_1),
            new DataMotherInfo("মায়ের যত্ন না নিলে না না সমস্যা হবনে।তাই যত্ন নিন",
                    "মায়ের যত্ন না নিলে না না সমস্যা হবনে।তাই যত্ন নিনমায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজনদসজখ সদফাকজলহ সদফ লজকাসদফ্লসদজ সদফঝলজক্ল গসদজখ দস্ফাক্লঝ সাজক্লহ দস্ফাল্কজল ল্কসদফজাগ ল্ক জগক্ল সদফগ। ",
                    R.drawable.cheese_2),
            new DataMotherInfo("মায়ের থেকে আপন কেউ নেই মায়ের যত্ন নিন ",
                    "মায়ের থেকে আপন কেউ নেই মায়ের যত্ন নিনমায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজনদসজখ সদফাকজলহ সদফ লজকাসদফ্লসদজ সদফঝলজক্ল গসদজখ দস্ফাক্লঝ সাজক্লহ দস্ফাল্কজল ল্কসদফজাগ ল্ক জগক্ল সদফগ। ",
                    R.drawable.cheese_3),
            new DataMotherInfo("মায়ের পায়ের নিচে সন্তানের বেহেসত।তাই মায়ের যত্ন নিন",
                    "মায়ের পায়ের নিচে সন্তানের বেহেসত।তাই মায়ের যত্ন নিনমায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজনদসজখ সদফাকজলহ সদফ লজকাসদফ্লসদজ সদফঝলজক্ল গসদজখ দস্ফাক্লঝ সাজক্লহ দস্ফাল্কজল ল্কসদফজাগ ল্ক জগক্ল সদফগ। ",
                    R.drawable.cheese_4),
            new DataMotherInfo("মায়ের থকালে দুনিয়াতে কেউ আসতে পারত না ।তাই মায়ের যত্ন নিন :) ",
                    "মায়ের থকালে দুনিয়াতে কেউ আসতে পারত না ।তাই মায়ের যত্ন নিনমায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজনদসজখ সদফাকজলহ সদফ লজকাসদফ্লসদজ সদফঝলজক্ল গসদজখ দস্ফাক্লঝ সাজক্লহ দস্ফাল্কজল ল্কসদফজাগ ল্ক জগক্ল সদফগ। ",
                    R.drawable.cheese_5),
            new DataMotherInfo("মায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজন",
                    "মায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজনদসজখ সদফাকজলহ সদফ লজকাসদফ্লসদজ সদফঝলজক্ল গসদজখ দস্ফাক্লঝ সাজক্লহ দস্ফাল্কজল ল্কসদফজাগ ল্ক জগক্ল সদফগ। ",
                    R.drawable.cheese_1),
            new DataMotherInfo("মায়ের যত্ন না নিলে না না সমস্যা হবনে।তাই যত্ন নিন",
                    "মায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজনদসজখ সদফাকজলহ সদফ লজকাসদফ্লসদজ সদফঝলজক্ল গসদজখ দস্ফাক্লঝ সাজক্লহ দস্ফাল্কজল ল্কসদফজাগ ল্ক জগক্ল সদফগ। ",
                    R.drawable.cheese_2),
            new DataMotherInfo("্মায়ের থেকে আপন কেউ নেই মায়ের যত্ন নিন ",
                    "মায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজনদসজখ সদফাকজলহ সদফ লজকাসদফ্লসদজ সদফঝলজক্ল গসদজখ দস্ফাক্লঝ সাজক্লহ দস্ফাল্কজল ল্কসদফজাগ ল্ক জগক্ল সদফগ। ",
                    R.drawable.cheese_3),
            new DataMotherInfo("মায়ের পায়ের নিচে সন্তানের বেহেসত।তাই মায়ের যত্ন নিন",
                    "মায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজনদসজখ সদফাকজলহ সদফ লজকাসদফ্লসদজ সদফঝলজক্ল গসদজখ দস্ফাক্লঝ সাজক্লহ দস্ফাল্কজল ল্কসদফজাগ ল্ক জগক্ল সদফগ। ",
                    R.drawable.cheese_4),
            new DataMotherInfo("মা না  থকালে দুনিয়াতে কেউ আসতে পারত না ।তাই মায়ের যত্ন নিন :) ",
                    "মায়ের যত্ন নিন।মায়ের যত্ন নেয়া প্রয়োজনদসজখ সদফাকজলহ সদফ লজকাসদফ্লসদজ সদফঝলজক্ল গসদজখ দস্ফাক্লঝ সাজক্লহ দস্ফাল্কজল ল্কসদফজাগ ল্ক জগক্ল সদফগ। ",
                    R.drawable.cheese_5)


    };
    //Each Drink has a name, description, and an image resource
    private DataMotherInfo(String info,String description,int imageResourceId) {
        this.info = info;
        this.description = description;
        this.imageResourceId = imageResourceId;
    }
    public String getInfo() {
        return info;
    }
    public String getDescription(){
        return description;
    }
    public int getImageResourceId() {
        return imageResourceId;
    }
    public String toString() {
        return this.info;
    }
}
